#include <iostream>
#include <cmath>
#include <Windows.h>
#include <vector>
#include <string>

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	std::vector<std::string> students_info = {
		"Авдєєв Єгор Сергійович",
		"Вареников Даніїл Родіонович",
		"Гаврилюк Артем Валентинович",
		"Гладченко Анастасія Вікторівна",
		"Гонтаренко Олексій Владиславович",
		"Джос Євгенія Володимирівна",
		"Заруднєв Володимир Олександрович",
		"Іваницький Дмитро Олександрович",
		"Ковтун Максим Віталійович",
		"Коряк Давид Русланович",
		"Куча Євген Юрійович",
		"Лутай Мирослава Олександрівна",
		"Малик Поліна Євгенівна",
		"Польова Дарія Олександрівна",
		"Прокошина Карина Ігорівна",
		"Рачкова Єлизавета Євгеніївна",
		"Рябокінь Дмитро Олександрович",
		"Середа Ілля Петрович",
		"Синяченко Богдан Вадимович",
		"Стяглюк Анна Олександрівна",
		"Тищенко Андрій Борисович",
		"Трісунов Євген Русланович",
		"Царанова Софія Олександрівна",
		"Шаповалов Максим Павлович",
		"Щербак В`ячеслав Олександрович"
	};

	int student_number;
	std::cout << "Введіть номер студента: ";
	std::cin >> student_number;

	if (student_number <= 0 || student_number > students_info.size()) {
		std::cout << "Некорректний номер студента.";
		return 1;
	}
	
	std::cout << students_info[student_number - 1] << std::endl;
	return 0;
}
